## python 기본 문법
# 주석을 해시태그로 표시한다
# 변수의 자료형에 대한 선언 없음 (저장되는 값에 따라 자동으로 자료형 지정됨)
# 문장의 끝에 세미콜론(;) 사용할 필요 없음 (한 줄에 여러 문장일 때만 사용)
num = 1; print(num)

# 코드블록이 있으면 콜론(:)과 여백으로 구분한다
# 변수에 연속해서 값 저장 가능
x,y,z = 10,20,30
print(x + y - z)

## python 기본 출력함수 (내장함수 print)
print(20)
print(3 + 3)

## python 기본 입력함수 input 
# x = input('안녕하세요!')
# 이걸 입력한 이후에 작성하는 코드는 출력되지 않음
# -> 입력함수는 출력 이후 사용자의 입력을 기다리기 때문

# ---------------------------------------------------------------------
## python 데이터 타입
# 정수 (integer)
print(2)
print(2 + 7)

# 소수 (floating point)
print(2.0)

# 문자열 (string)
print("hello world")
print("2")
print("2" + "7")

# 불리언 (boolean)
print(3 < 7)
print(2 > 5)
